In [2]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://root:root@localhost:5432/uber')
engine.connect()

In [4]:
%load_ext sql
%sql postgresql://root:root@localhost:5432/uber

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
%%sql
SELECT * FROM main LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
10 rows affected.

[(19413262, 'HV0003', 'B02864', 'B02864', datetime.datetime(2019, 7, 30, 17, 19, 3), datetime.datetime(2019, 7, 30, 17, 19, 22), datetime.datetime(2019, 7, 30, 17, 27, 8), datetime.datetime(2019, 7, 30, 17, 55, 39), 233, 48, 2.82, 1710, 23.5, 0.0, 0.0, 2.04, 2.75, None, 0.0, 17.2, 'N', 'N', ' ', 'N', 'N'),
 (10669053, 'HV0003', 'B02872', 'B02872', datetime.datetime(2019, 7, 18, 7, 40, 3), datetime.datetime(2019, 7, 18, 7, 42, 52), datetime.datetime(2019, 7, 18, 7, 43, 40), datetime.datetime(2019, 7, 18, 7, 55, 11), 224, 233, 2.35, 691, 4.36, 0.0, 0.0, 0.39, 0.75, None, 1.0, 5.48, 'Y', 'Y', ' ', 'N', ' '),
 (5101164, 'HV0003', 'B02682', 'B02682', datetime.datetime(2019, 7, 9, 21, 37, 27), datetime.datetime(2019, 7, 9, 21, 42, 52), datetime.datetime(2019, 7, 9, 21, 46, 5), datetime.datetime(2019, 7, 9, 22, 28, 34), 124, 7, 17.76, 2549, 22.1, 0.0, 0.0, 1.91, 0.0, None, 0.0, 30.36, 'Y', 'Y', ' ', 'N', ' '),
 (1310001, 'HV0003', 'B02764', 'B02764', datetime.datetime(2019, 7, 3, 10, 10, 33), datetime.datetime(2019, 7, 3, 10, 10, 44), datetime.datetime(2019, 7, 3, 10, 12, 56), datetime.datetime(2019, 7, 3, 10, 38, 18), 162, 138, 9.06, 1522, 32.86, 6.12, 0.0, 3.38, 2.75, None, 0.0, 28.6, 'N', 'N', ' ', 'N', ' '),
 (9802365, 'HV0003', 'B02869', 'B02869', datetime.datetime(2019, 7, 16, 21, 25, 1), datetime.datetime(2019, 7, 16, 21, 27, 25), datetime.datetime(2019, 7, 16, 21, 28, 43), datetime.datetime(2019, 7, 16, 21, 37, 1), 198, 226, 2.3, 498, 9.64, 0.0, 0.0, 0.84, 0.0, None, 0.0, 6.63, 'N', 'N', ' ', 'N', ' '),
 (17509961, 'HV0003', 'B02617', 'B02617', datetime.datetime(2019, 7, 27, 19, 25, 49), datetime.datetime(2019, 7, 27, 19, 27, 37), datetime.datetime(2019, 7, 27, 19, 28, 27), datetime.datetime(2019, 7, 27, 19, 56, 38), 231, 100, 2.78, 1692, 14.49, 0.0, 0.0, 1.32, 2.75, None, 0.0, 17.0, 'N', 'N', ' ', 'N', 'N'),
 (10057147, 'HV0005', 'B02510', None, datetime.datetime(2019, 7, 17, 9, 18, 10), None, datetime.datetime(2019, 7, 17, 9, 24, 56), datetime.datetime(2019, 7, 17, 9, 36, 59), 55, 108, 0.602, 723, 6.84, 0.0, 0.17, 0.61, 0.0, None, 0.0, 6.63, 'N', 'N', 'N', 'N', 'N'),
 (4117356, 'HV0003', 'B02888', 'B02888', datetime.datetime(2019, 7, 8, 4, 13, 28), datetime.datetime(2019, 7, 8, 4, 18, 2), datetime.datetime(2019, 7, 8, 4, 19, 16), datetime.datetime(2019, 7, 8, 4, 30, 15), 42, 169, 3.9, 658, 15.88, 0.0, 0.0, 1.37, 0.0, None, 0.0, 9.7, 'N', 'N', ' ', 'N', ' '),
 (16375661, 'HV0003', 'B02867', 'B02867', datetime.datetime(2019, 7, 26, 9, 15, 7), datetime.datetime(2019, 7, 26, 9, 22, 45), datetime.datetime(2019, 7, 26, 9, 24), datetime.datetime(2019, 7, 26, 9, 47, 56), 79, 170, 2.34, 1436, 8.32, 0.0, 0.0, 0.72, 0.75, None, 0.0, 12.11, 'Y', 'Y', ' ', 'N', 'N'),
 (13740874, 'HV0004', 'B02800', None, datetime.datetime(2019, 7, 22, 8, 43, 13), None, datetime.datetime(2019, 7, 22, 8, 56, 49), datetime.datetime(2019, 7, 22, 9, 8, 45), 24, 42, 1.7, 716, 6.75, 0.0, 0.0, 0.6, 0.0, None, 0.0, 0.0, 'Y', 'Y', 'N', 'N', 'N')]

In [10]:
%%sql
DROP TABLE IF EXISTS inflows ;

CREATE TEMPORARY TABLE inflows AS 
SELECT "PULocationID" "location",
COALESCE(COUNT(*), 0)::numeric count
FROM main
WHERE "PULocationID" != "DOLocationID"
GROUP BY "PULocationID"
ORDER BY "PULocationID";

SELECT * FROM inflows LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
Done.
259 rows affected.
10 rows affected.

[(1, Decimal('5')),
 (3, Decimal('191')),
 (4, Decimal('419')),
 (5, Decimal('19')),
 (6, Decimal('33')),
 (7, Decimal('841')),
 (8, Decimal('5')),
 (9, Decimal('66')),
 (10, Decimal('253')),
 (11, Decimal('103'))]

In [11]:
%%sql
DROP TABLE IF EXISTS outflows;

CREATE TEMPORARY TABLE outflows AS 
SELECT "DOLocationID" "location",
COALESCE(COUNT(*), 0)::numeric count
FROM main
WHERE "PULocationID" != "DOLocationID"
GROUP BY "DOLocationID"
ORDER BY "DOLocationID";

SELECT * FROM outflows LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
Done.
258 rows affected.
10 rows affected.

[(1, Decimal('556')),
 (3, Decimal('183')),
 (4, Decimal('353')),
 (5, Decimal('15')),
 (6, Decimal('28')),
 (7, Decimal('809')),
 (8, Decimal('8')),
 (9, Decimal('74')),
 (10, Decimal('214')),
 (11, Decimal('101'))]

In [13]:
%%sql
DROP TABLE IF EXISTS locals;

CREATE TEMPORARY TABLE locals AS 
SELECT "DOLocationID" "location",
COALESCE(COUNT(*), 0)::numeric count
FROM main
WHERE "PULocationID" = "DOLocationID"
GROUP BY "DOLocationID"
ORDER BY "DOLocationID";

SELECT * FROM locals LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
Done.
235 rows affected.
10 rows affected.

[(3, Decimal('13')),
 (4, Decimal('2')),
 (5, Decimal('3')),
 (6, Decimal('4')),
 (7, Decimal('133')),
 (9, Decimal('7')),
 (10, Decimal('16')),
 (11, Decimal('6')),
 (13, Decimal('8')),
 (14, Decimal('128'))]

In [14]:
%%sql
SELECT * FROM zones LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
10 rows affected.

[(0, 1, 'EWR', 'Newark Airport', 'EWR'),
 (1, 2, 'Queens', 'Jamaica Bay', 'Boro Zone'),
 (2, 3, 'Bronx', 'Allerton/Pelham Gardens', 'Boro Zone'),
 (3, 4, 'Manhattan', 'Alphabet City', 'Yellow Zone'),
 (4, 5, 'Staten Island', 'Arden Heights', 'Boro Zone'),
 (5, 6, 'Staten Island', 'Arrochar/Fort Wadsworth', 'Boro Zone'),
 (6, 7, 'Queens', 'Astoria', 'Boro Zone'),
 (7, 8, 'Queens', 'Astoria Park', 'Boro Zone'),
 (8, 9, 'Queens', 'Auburndale', 'Boro Zone'),
 (9, 10, 'Queens', 'Baisley Park', 'Boro Zone')]

In [24]:
%%sql
DROP TABLE IF EXISTS flows;

CREATE TEMPORARY TABLE flows AS 
SELECT 
zones."Zone", 
COALESCE(inflows.count, 0) inflows,
COALESCE(outflows.count, 0) outflows,
COALESCE(locals.count, 0) locals
FROM zones 
    LEFT JOIN inflows 
    ON zones."LocationID" = inflows.location
    LEFT JOIN outflows 
    ON zones."LocationID" = outflows.location
    LEFT JOIN locals 
    ON zones."LocationID" = locals.location
;

SELECT * FROM flows LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
Done.
265 rows affected.
10 rows affected.

[('Allerton/Pelham Gardens', Decimal('191'), Decimal('183'), Decimal('13')),
 ('Alphabet City', Decimal('419'), Decimal('353'), Decimal('2')),
 ('Arden Heights', Decimal('19'), Decimal('15'), Decimal('3')),
 ('Arrochar/Fort Wadsworth', Decimal('33'), Decimal('28'), Decimal('4')),
 ('Astoria', Decimal('841'), Decimal('809'), Decimal('133')),
 ('Auburndale', Decimal('66'), Decimal('74'), Decimal('7')),
 ('Baisley Park', Decimal('253'), Decimal('214'), Decimal('16')),
 ('Bath Beach', Decimal('103'), Decimal('101'), Decimal('6')),
 ('Battery Park City', Decimal('580'), Decimal('608'), Decimal('8')),
 ('Bay Ridge', Decimal('372'), Decimal('389'), Decimal('128'))]

In [25]:
%%sql
ALTER TABLE flows 
ADD total int;

UPDATE flows
SET total = inflows + outflows + locals;

SELECT * FROM flows LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
Done.
265 rows affected.
10 rows affected.

[('Allerton/Pelham Gardens', Decimal('191'), Decimal('183'), Decimal('13'), 387),
 ('Alphabet City', Decimal('419'), Decimal('353'), Decimal('2'), 774),
 ('Arden Heights', Decimal('19'), Decimal('15'), Decimal('3'), 37),
 ('Arrochar/Fort Wadsworth', Decimal('33'), Decimal('28'), Decimal('4'), 65),
 ('Astoria', Decimal('841'), Decimal('809'), Decimal('133'), 1783),
 ('Auburndale', Decimal('66'), Decimal('74'), Decimal('7'), 147),
 ('Baisley Park', Decimal('253'), Decimal('214'), Decimal('16'), 483),
 ('Bath Beach', Decimal('103'), Decimal('101'), Decimal('6'), 210),
 ('Battery Park City', Decimal('580'), Decimal('608'), Decimal('8'), 1196),
 ('Bay Ridge', Decimal('372'), Decimal('389'), Decimal('128'), 889)]

### Highest Percent of Inflows

In [34]:
%%sql
SELECT 
flows."Zone",
ROUND(
    100*inflows / (total)
,2) inflow_percent, 
inflows, outflows
FROM flows
WHERE (inflows + outflows > 0)
ORDER BY (inflows / (total)) DESC
LIMIT 20;

 * postgresql://root:***@localhost:5432/uber
20 rows affected.

[('Great Kills Park', Decimal('100.00'), Decimal('1'), Decimal('0')),
 ('Willets Point', Decimal('68.18'), Decimal('15'), Decimal('7')),
 ('Port Richmond', Decimal('60.71'), Decimal('51'), Decimal('32')),
 ('Glen Oaks', Decimal('60.00'), Decimal('69'), Decimal('40')),
 ('Marble Hill', Decimal('59.46'), Decimal('88'), Decimal('58')),
 ('Rosedale', Decimal('58.92'), Decimal('142'), Decimal('81')),
 ('Bellerose', Decimal('58.49'), Decimal('62'), Decimal('42')),
 ('Flatiron', Decimal('57.60'), Decimal('690'), Decimal('505')),
 ('New Dorp/Midland Beach', Decimal('57.14'), Decimal('52'), Decimal('34')),
 ('Sutton Place/Turtle Bay North', Decimal('57.04'), Decimal('717'), Decimal('535')),
 ('Parkchester', Decimal('56.47'), Decimal('227'), Decimal('169')),
 ('Country Club', Decimal('56.45'), Decimal('35'), Decimal('27')),
 ('Lincoln Square West', Decimal('56.24'), Decimal('500'), Decimal('378')),
 ('Bay Terrace/Fort Totten', Decimal('55.75'), Decimal('63'), Decimal('47')),
 ('West Brighton', Decimal('55.74'), Decimal('68'), Decimal('51')),
 ('East Village', Decimal('55.57'), Decimal('1557'), Decimal('1212')),
 ('Soundview/Bruckner', Decimal('55.56'), Decimal('255'), Decimal('196')),
 ('Greenwich Village South', Decimal('55.49'), Decimal('702'), Decimal('558')),
 ('Kew Gardens Hills', Decimal('55.18'), Decimal('165'), Decimal('121')),
 ('South Jamaica', Decimal('55.11'), Decimal('275'), Decimal('209'))]

### Highest Percent of Outflows

In [33]:
%%sql
SELECT 
flows."Zone",
ROUND(
    100*outflows / (total)
,2) outflow_percent, 
inflows, outflows
FROM flows
WHERE (total > 0)
ORDER BY (outflows / (total)) DESC
LIMIT 20;

 * postgresql://root:***@localhost:5432/uber
20 rows affected.

[('Freshkills Park', Decimal('100.00'), Decimal('0'), Decimal('1')),
 (None, Decimal('99.78'), Decimal('4'), Decimal('3235')),
 ('Newark Airport', Decimal('99.11'), Decimal('5'), Decimal('556')),
 ('Saint Michaels Cemetery/Woodside', Decimal('78.57'), Decimal('3'), Decimal('11')),
 ('Green-Wood Cemetery', Decimal('71.43'), Decimal('2'), Decimal('5')),
 ('Forest Park/Highland Park', Decimal('70.37'), Decimal('8'), Decimal('19')),
 ('Highbridge Park', Decimal('67.86'), Decimal('9'), Decimal('19')),
 ('Randalls Island', Decimal('66.04'), Decimal('18'), Decimal('35')),
 ('Pelham Bay Park', Decimal('65.00'), Decimal('27'), Decimal('52')),
 ('City Island', Decimal('62.30'), Decimal('23'), Decimal('38')),
 ('Astoria Park', Decimal('61.54'), Decimal('5'), Decimal('8')),
 ('Prospect Park', Decimal('59.47'), Decimal('77'), Decimal('113')),
 ('Inwood Hill Park', Decimal('59.18'), Decimal('20'), Decimal('29')),
 ('Marine Park/Floyd Bennett Field', Decimal('58.62'), Decimal('12'), Decimal('17')),
 ('Central Park', Decimal('57.96'), Decimal('186'), Decimal('262')),
 ('Penn Station/Madison Sq West', Decimal('55.68'), Decimal('902'), Decimal('1137')),
 ('Columbia Street', Decimal('55.65'), Decimal('51'), Decimal('64')),
 ('Battery Park', Decimal('55.10'), Decimal('22'), Decimal('27')),
 ('Financial District South', Decimal('53.98'), Decimal('259'), Decimal('305')),
 ('Middle Village', Decimal('53.76'), Decimal('142'), Decimal('186'))]

### Airports

In [31]:
%%sql
SELECT 
flows."Zone",
ROUND(
    100*inflows / (total)
,2) inflow_percent, 
ROUND(
    100*outflows / (total)
,2) outflow_percent, 
ROUND(
    100*locals / (total)
,2) local_percent, 
total
FROM flows
WHERE "Zone" LIKE '%Airport%'
ORDER BY (inflows / (total)) ASC
LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
3 rows affected.

[('Newark Airport', Decimal('0.89'), Decimal('99.11'), Decimal('0.00'), 561),
 ('JFK Airport', Decimal('45.39'), Decimal('53.05'), Decimal('1.55'), 3538),
 ('LaGuardia Airport', Decimal('46.42'), Decimal('53.37'), Decimal('0.22'), 3697)]